rowanseymour/crowtides/sdkconfig.defaults
# ESP32-S3-WROOM-1-N8R8 (8MB flash, 8MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Fail boot loudly if PSRAM doesn't come up rather than continuing without it
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
